In [17]:
import pandas as pd, numpy as np

1. Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
of the data types into a pandas series. Create a separate list of index values for the
series

In [18]:
lst=[1,2,3,4,5,6,7,8,9,10]
tup=(1,2,3,4,5,6,7,8,9,10)
s={1,2,3,4,5,6,7,8,9,10}

In [19]:
s1=pd.Series(lst, index=['a','b','c','d','e','f','g','h','i','j'])
s2=pd.Series(tup,  index=['a','b','c','d','e','f','g','h','i','j'])

In [21]:
print(s1)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [22]:
print(s2)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [23]:
s3=pd.Series(s, index=['a','b','c','d','e','f','g','h','i','j'])

TypeError: 'set' type is unordered

2. Create a python dictionary with three key value pairs. Keep the keys as the first names,
and the respective last names as values in the dictionary. Use the dictionary to create a
pandas series.

In [28]:
names = {"Brian": "Lara", "Ricky": "Ponting", "Micheal": "Clarke"}
series_names = pd.Series(names)
print(series_names)

Brian         Lara
Ricky      Ponting
Micheal     Clarke
dtype: object

3. Create a pandas series, with the elements as numbers from 1-10. Use the index values
starting from 0-10. For the above series:

a. Convert it to a list.

b. Convert it to a dictionary.

c. Convert it to a tuple.

d. Convert it to a set.

In [32]:
s= pd.Series(range(1,11))
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [34]:
num = pd.Series(range(1,11))
print(num)

# a
print(list(num))  #to_list()

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [35]:
# b

tuple(num)

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [36]:
# c

set(num)

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [39]:
# d

d=num.to_dict()
d

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

4. Create a sample pandas series with x integer elements. Perform the following operations
on the same:

a. Print the first 5 elements of the series

b. Print the last 5 elements of the series

c. Insert an integer value ‘50’ at the index 5

d. Update the last element in the series with the value 100

e. Delete the first element from the series

Note: The index values must not be affected by the operations and should be uniform for
the series after the last operation.

In [41]:
# head(), tail(), .iloc[], iloc[9]=100, drop()

In [43]:
ser=pd.Series(range(1,11))
ser

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [46]:
# a
ser.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [49]:
# b

ser.tail()

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [51]:
# c

ser.iloc[5] = 50

In [52]:
ser

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [54]:
# d

ser.iloc[-1] = 100  # ser.iloc[9]=100

In [55]:
ser

0      1
1      2
2      3
3      4
4      5
5     50
6      7
7      8
8      9
9    100
dtype: int64

In [58]:
ser.drop(0, inplace=True)

In [59]:
ser

1      2
2      3
3      4
4      5
5     50
6      7
7      8
8      9
9    100
dtype: int64

In [60]:
# reset_index()

In [79]:
ser.reset_index(drop=True, inplace=True)

5. For a given pandas series obtained in the 4th step. Write a sample code to find the
element 100 in the series.

In [80]:
ser

0      2
1      3
2      4
3      5
4     50
5      7
6      8
7      9
8    100
dtype: int64

In [81]:
# 1

x=lambda a:f'100 is present at {list(a).index(100)}'
x(ser)

'100 is present at 8'

In [82]:
# 2

for i in range(len(ser)):
    if ser.iloc[i]==100:
        print('100', 'is found at location',i)

100 is found at location 8

In [85]:
# 3

def find(ser, val):
    for i in ser.index:
        if ser[i] == val: 
            return i
    return None

print('100 is present at position: ',find(ser,100))

100 is present at position:  8

6. For the given series A and B, perform concatenation on the same.

series_A = pd.Series([1,2,3,4,5])

series_B = pd.Series([6,7,8,9,10])

In [86]:
# 1

series_A = pd.Series([1,2,3,4,5])

series_B = pd.Series([6,7,8,9,10])

In [87]:
series_A

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [88]:
series_B

0     6
1     7
2     8
3     9
4    10
dtype: int64

In [89]:
joined = pd.concat((series_A,series_B))   # ignore_index=True

joined

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [90]:
joined.reset_index(drop=True, inplace=True)
joined

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [91]:
# 2

series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])
series_C=pd.concat([series_A, series_B],ignore_index=True)
series_C

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

7. Using loops in python, print all the elements within a pandas series.
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [92]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [94]:

for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

8. For a given nested list and a sample dictionary, create two data frames using pandas.

List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [95]:
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [96]:
df1= pd.DataFrame(List)

df2= pd.DataFrame(Dictionary)

In [97]:
df1

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [98]:
df2

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following
operations on the same.

a. Print the first 3 rows of the Data Frame 

b. Print the rows that have the age greater than 15

c. Insert 5 imaginary names and ages as values to the pandas Data Frame

d. Update the 5th row so that the name = john and age=56

e. Delete the first row from the Data Frame

In [119]:
d={'Name':['Virat', 'Sachin','Viru','Rohit'], 'Age':[20,40,32,15]}

In [120]:
df=pd.DataFrame(d)

In [121]:
df

     Name  Age
0   Virat   20
1  Sachin   40
2    Viru   32
3   Rohit   15

In [122]:
# a

df.head(3)

     Name  Age
0   Virat   20
1  Sachin   40
2    Viru   32

In [123]:
# b

df[df['Age']>15]

     Name  Age
0   Virat   20
1  Sachin   40
2    Viru   32

In [124]:
# c

df.loc[4]=['a',25]
df.loc[5]=['b',10]
df.loc[6]=['c',12]
df.loc[7]=['d',55]
df.loc[8]=['e',30]

In [125]:
df

     Name  Age
0   Virat   20
1  Sachin   40
2    Viru   32
3   Rohit   15
4       a   25
5       b   10
6       c   12
7       d   55
8       e   30

In [126]:
# d

df.loc[4]=['john',56]
df

     Name  Age
0   Virat   20
1  Sachin   40
2    Viru   32
3   Rohit   15
4    john   56
5       b   10
6       c   12
7       d   55
8       e   30

In [127]:
# e

df.drop(0,inplace=True)
df

     Name  Age
1  Sachin   40
2    Viru   32
3   Rohit   15
4    john   56
5       b   10
6       c   12
7       d   55
8       e   30

In [130]:
df.reset_index(drop=True, inplace=True)

In [131]:
df

     Name  Age
0  Sachin   40
1    Viru   32
2   Rohit   15
3    john   56
4       b   10
5       c   12
6       d   55
7       e   30

10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary
respectively.

In [132]:
df

     Name  Age
0  Sachin   40
1    Viru   32
2   Rohit   15
3    john   56
4       b   10
5       c   12
6       d   55
7       e   30

In [133]:
l=list(df)
l

['Name', 'Age']

In [139]:
l=list(df.values)
l

[array(['Sachin', 40], dtype=object),
 array(['Viru', 32], dtype=object),
 array(['Rohit', 15], dtype=object),
 array(['john', 56], dtype=object),
 array(['b', 10], dtype=object),
 array(['c', 12], dtype=object),
 array(['d', 55], dtype=object),
 array(['e', 30], dtype=object)]

In [142]:
df.values.tolist()

[['Sachin', 40],
 ['Viru', 32],
 ['Rohit', 15],
 ['john', 56],
 ['b', 10],
 ['c', 12],
 ['d', 55],
 ['e', 30]]

In [145]:
df.to_dict()

{'Name': {0: 'Sachin',
  1: 'Viru',
  2: 'Rohit',
  3: 'john',
  4: 'b',
  5: 'c',
  6: 'd',
  7: 'e'},
 'Age': {0: 40, 1: 32, 2: 15, 3: 56, 4: 10, 5: 12, 6: 55, 7: 30}}

11. Create two separate Data Frames A and B, and perform the following operations on
them.

a. Concatenate the two Data Frame s to a new Data Frame C.

b. Split the Data Frame C row wise.

c. Split the Data Frame column wise based on a condition. For example - columns
values greater than 10, column values less than 10, etc.

In [148]:
df1 = pd.DataFrame(range(1,11), columns=['A'])

df2 = pd.DataFrame(range(11,21), columns= ['B'])

In [149]:
df1

    A
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [150]:
df2

    B
0  11
1  12
2  13
3  14
4  15
5  16
6  17
7  18
8  19
9  20

In [151]:
# a

C = pd.concat([df1,df2])

In [152]:
C

      A     B
0   1.0   NaN
1   2.0   NaN
2   3.0   NaN
3   4.0   NaN
4   5.0   NaN
5   6.0   NaN
6   7.0   NaN
7   8.0   NaN
8   9.0   NaN
9  10.0   NaN
0   NaN  11.0
1   NaN  12.0
2   NaN  13.0
3   NaN  14.0
4   NaN  15.0
5   NaN  16.0
6   NaN  17.0
7   NaN  18.0
8   NaN  19.0
9   NaN  20.0

In [153]:
C.reset_index(drop=True, inplace=True)
C

       A     B
0    1.0   NaN
1    2.0   NaN
2    3.0   NaN
3    4.0   NaN
4    5.0   NaN
5    6.0   NaN
6    7.0   NaN
7    8.0   NaN
8    9.0   NaN
9   10.0   NaN
10   NaN  11.0
11   NaN  12.0
12   NaN  13.0
13   NaN  14.0
14   NaN  15.0
15   NaN  16.0
16   NaN  17.0
17   NaN  18.0
18   NaN  19.0
19   NaN  20.0

In [154]:
C = pd.concat([df1,df2], axis=1)

In [155]:
C

    A   B
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [156]:
# b

C.iloc[0:5,:]   # C[start_row:end_row, start_col: end_col]

   A   B
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [158]:
# c

C[C['A']>5]

    A   B
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

12. Create a Data Frame with columns Name and Age. Perform the following operations.

a. Write a sample code to search for the Name/Names where Age is 20.

b. Sort the Data Frame in ascending order of ages.

c. Using Python loops, print the ages from the data frame and store it in a set.

In [159]:
d={'Name':['Virat', 'Sachin','Viru','Rohit'], 'Age':[20,40,32,15]}
df=pd.DataFrame(d)

In [160]:
df

     Name  Age
0   Virat   20
1  Sachin   40
2    Viru   32
3   Rohit   15

In [ ]:
#a
A[A['Age']==20]

#b
A.sort_values('Age')

#c
s={}
a=0
for i in A['Age']:
    s[a]=i
    a+=1
print(s)

In [161]:
# a

df[df['Age']==20]

    Name  Age
0  Virat   20

In [162]:
# b

df.sort_values(by='Age')

     Name  Age
3   Rohit   15
0   Virat   20
2    Viru   32
1  Sachin   40

In [170]:
# c

# 1

l=[]
    
for i in range(len(df)):
    l.append(df.iloc[i][1])
    
l

[20, 40, 32, 15]

In [171]:
s=set(l)

In [172]:
s

{15, 20, 32, 40}

In [173]:
# 2

for i in range(len(df)):
    setA=df.loc[:,'Age']

In [174]:
s=set(setA)
s

{15, 20, 32, 40}